import Icon from '../models/icon';

const PRODUCTS = [
  new Icon(
    'icon_1',
    ['category_1'],
    'u1',
    `Εικόνα του Κυρίου ημών Ιησού Χριστού`,
    'https://i.pinimg.com/564x/b9/79/fe/b979fe5f5d87be38e581fd5d8fca4067.jpg',
    `Ίσως η ωραιότερη εικόνα του Χριστού είναι η εγκαυστική εικόνα του Χριστού Παντοκράτορος (πρώτο μισό του 6ου αιώνος, 84 x 46 εκατ.), η οποία φυλλάσεται στην Ιερά Μονή Αγίας Αικατερίνης – Σινά. Πρόκειται για την παλαιότερη γνωστή εικόνα αυτού του τύπου. Φορώντας ιμάτια και χιτώνα ο Σωτήρας ευλογεί με το δεξί χέρι κρατώντας το Ευαγγέλιο στο αριστερό χέρι. Το υπερβατικό βλέμμα και η ευγένεια της μορφής συνυπάρχουν με τα προσωπογραφικά στοιχεία, ώστε να εκφρασθεί η ένωση θείας και ανθρώπινης φύσεως στο πρόσωπο του Θεανθρώπου.Το πρότυπο της εικόνας αυτής έχει συνδεθεί από την έρευνα με τη μορφή του Χριστού Χαλκίτη, ονομαστή εικόνα που βρισκόταν στο Ιερό Παλάτιον της Κωνσταντινουπόλεως. 
    Πηγή: https://www.pemptousia.gr/2011/05/to-theovadiston-oros-sina/`,
    1.50
  ),
  new Icon(
    'icon_2',
    ['category_1'],
    'u1',
    'Εικόνα Παναγίας Γλυκοφιλούσας ',
    'https://www.sfaturiortodoxe.ro/muntele-athos/icoane/Untitled-16.jpg',
    `Το καλύτερο Κειμήλιο για τη Μονή Φιλοθέου, για το οποίο αυτή ιδιαίτερα σεμνύνεται, είναι η αξιόλογη και Θαυματουργική Εικόνα της Παναγίας της Γλυκοφιλούσας, που βρίσκεται στο αριστερό προσκυνητάρι του Καθολικού. Η «Γλυκοφιλούσα» διασώθηκε από την εικονομαχία και μεταφέρθηκε στο Όρος ως εξής:
 
    Υπήρχε μια γυναίκα ευσεβής και ενάρετη, η Βικτωρία, που προσκυνούσε κρυφά τις Αγίες Εικόνες, παρά την απαγόρευση του βασιλιά Θεόφιλου του Εικονομάχου. Στο σπίτι της φύλαγε την Εικόνα της Γλυκοφιλούσας και κάποια μέρα που οι εικονομάχοι έκαναν έρευνα για να βρουν κρυμμένες Εικόνες, η Βικτωρία, πιεζόμενη και από τον εικονομάχο άνδρα της, πήρε την Εικόνα και κατέβηκε στη θάλασσα. Αφού την καταφίλησε με πόνο και δάκρυα, παρακάλεσε την Παναγία να διαφυλάξει την Εικόνα, την οποία έβαλε στη θάλασσα, ελπίζοντας μετά από την μανία της εικονομαχίας να την ξαναπάρει.
     
    Η Αγία Εικόνα όμως, στάθηκε όρθια και άρχισε να πλέει Θαυματουργικά πάνω στα νερά. Διέπλευσε το πέλαγος του Μαρμαρά, τον Ελλήσποντο και το Αιγαίο και σταμάτησε στο Άγιο Όρος, στο λιμάνι της Μονής Φιλοθέου. Αποκαλύφθηκε στον Ηγούμενο της Μονής να κατέβει και να υποδεχθεί την Εικόνα. Ηγούμενος και Μοναχοί κατεβαίνουν στο λιμάνι και αντικρίζουν την Εικόνα να ακτινοβολεί Θείο Φως.
     
    Μόλις ο Ηγούμενος βγήκε από τη θάλασσα με την Αγία Εικόνα, ανέβλυσε στο τόπο όπου πρώτα στάθηκε η Εικόνα, Αγίασμα ιαματικό για κάθε νόσο. Με ψαλμούς και ύμνους, με φώτα και θυμιάματα, ανέβασαν την Εικόνα στο Ιερό Μοναστήρι και την τοποθέτησαν εκεί που ως σήμερα βρίσκεται. Από τότε και κάθε χρόνο, την Δευτέρα της Διακαινησίμου, ως ανάμνηση του Θαύματος, τελείται εκεί στο Αγίασμα, λιτανεία και Αγιασμός.
    
    Πηγή: https://www.iellada.gr/thriskeia/i-thaymatoyrgi-eikona-tis-panagias-tis-glykofiloysas`,
    1.20
  ),
  new Icon(
    'icon_3',
    ['category_1'],
    'u3',
    'Εικόνα Αγίου Ιωάννη του Προδρόμου',
    'https://i.pinimg.com/564x/1c/13/39/1c1339de03a5ed172c8fabbf508866b0.jpg',
    `Άγιος Ιωάννης ο Πρόδρομος και Βαπτιστής - 1542 μ.Χ. (Kρητική σχολή. Eυφρόσυνος) - Mονή Διονυσίου, Άγιον Όρος
    Ο Ιωάννης ήταν γιος του ιερέα Ζαχαρία και της Ελισάβετ. Μέχρι τα τριάντα του χρόνια, ζει ασκητική ζωή στην έρημο της Ιουδαίας, αφιερωμένη ολοκληρωτικά στην προσευχή, τη μελέτη και την πνευματική και ηθική τελειοποίηση. Το ρούχο του ήταν από τρίχες καμήλας, στη μέση του είχε δερμάτινη ζώνη και την τροφή του αποτελούσαν ακρίδες και άγριο μέλι. Με μορφή ηλιοκαμένη, σοβαρός, αξιοπρεπής και δυναμικός, ο Ιωάννης φανέρωνε αμέσως φυσιογνωμία έκτακτη και υπέροχη. Είχε όλα τα προσόντα μεγάλου και επιβλητικού κήρυκα του θείου λόγου. Έτσι, με μεγάλη χάρη κήρυττε «τα πλήθη». Κατακεραύνωνε και χτυπούσε σκληρά τη φαρισαϊκή αλαζονική έπαρση, που κάτω από το εξωτερικό ένδυμα της ψευτοαγιότητας έκρυβε τις πιο αηδιαστικές πληγές ψυχικής σκληρότητας και ακαθαρσίας. Γενικά, η διδασκαλία του συνοψίζεται στη χαρακτηριστική φράση του: «Μετανοείτε· ήγγικε γαρ ή βασιλεία των ουρανών», προετοιμάζοντας, έτσι, το δρόμο του Κυρίου μας Ιησού Χριστού για το σωτήριο έργο Του. Όταν ο Χριστός άρχισε τη δημόσια δράση του, ο κόσμος άφηνε σιγά-σιγά τον Ιωάννη και ακολουθούσε Αυτόν. Η αντιστροφή αύτη, βέβαια, θα προκαλούσε μεγάλη πίκρα και θα γεννούσε αγκάθια ζήλειας και φθόνου σ' έναν, εκτός χριστιανικού πνεύματος, διδάσκαλο ή φιλόσοφο. Αντίθετα, στον Ιωάννη προκάλεσε μεγάλη χαρά και ευφροσύνη. Η γιορτή αυτή του Ιωάννου του Προδρόμου, για τον όποιο ο Κύριος είπε ότι κανείς άνθρωπος δε στάθηκε μεγαλύτερος του, καθιερώθηκε τον 5ο μ.Χ. αιώνα.
    
    Πηγή: http://www.saint.gr/110/saint.aspx
    `,
    5.6
  ),
  new Icon(
    'icon_4',
    ['category_1'],
    'u3',
    'Εικόνα Αγίου Φωτίου του Μέγα',
    'https://i.pinimg.com/564x/3f/19/44/3f1944706058590e38c752e8c9013bbc.jpg',
    `O Πατριάρχης Κωνσταντινουπόλεως Φώτιος (πρώτη πατριαρχία: 858-867, δεύτερη πατριαρχία: 878-886[1]), ο επονομαζόμενος και Μέγας, ήταν η σημαντικότερη εκκλησιαστική και πνευματική προσωπικότητα των μεσο-βυζαντινών χρόνων[2] (γέν. Κωνσταντινούπολη 820; – κοίμ. Μονή Αρμ(ε)ινιανών[3] 6η Φεβρουαρίου 891/2/3[4]), αλλά και μεγάλη ιστορική μορφή της Πολιτείας και των Γραμμάτων, και άγιος της Ορθόδοξης Εκκλησίας[5]. Ο Μέγας Φώτιος, εξέχων λόγιος, διδάσκαλος, κρατικός λειτουργός, Ιεράρχης, πρεσβευτής, διπλωμάτης, ιεραπόστολος, συγγραφέας εκκλησιαστικός αλλά και της "θύραθεν" γραμματείας του 9ου αιώνα[6], συνέδεσε το όνομά του με το πρώτο ρήγμα μεταξύ των Εκκλησιών Ρώμης και Κωνσταντινουπόλεως[7] (Φώτειο σχίσμα, 863-867), αλλά και με την "αξιοποίηση του ανεξάντλητου πλούτου της κλασικής ελληνικής σοφίας"[8] που οδήγησε σε άνθηση των ελληνικών γραμμάτων[9].
    Πηγή: https://el.orthodoxwiki.org/%CE%A6%CF%8E%CF%84%CE%B9%CE%BF%CF%82_%CE%91%CE%84_%CE%BF_%CE%9C%CE%AD%CE%B3%CE%B1%CF%82`,
    2.23
  ),
  new Icon(
    'icon_5',
    ['category_1'],
    'u1',
    'Εικόνα του Οσίου Παϊσίου του Αγιορείτη',
    'https://i.pinimg.com/564x/c6/b5/5e/c6b55ed63fc9fe6270d488d03f9aae5e.jpg',
    `Ο Άγιος Παΐσιος o Αγιορείτης (κατά κόσμον Αρσένιος Εζνεπίδης, 25 Ιουλίου 1924 - 12 Ιουλίου 1994) ήταν Έλληνας μοναχός του 20ού αιώνα που έγινε ευρέως γνωστός για τον βίο και το έργο του. Η κατάταξή του ως αγίου της Ορθοδόξου Εκκλησίας πραγματοποιήθηκε από το Οικουμενικό Πατριαρχείο Κωνσταντινουπόλεως στις 13 Ιανουαρίου 2015[2], ενώ η Ορθόδοξη Εκκλησία εορτάζει τη μνήμη του στις 12 Ιουλίου.[3] Το 2017 ανακηρύχθηκε προστάτης άγιος του στρατιωτικού όπλου των Διαβιβάσεων, με απόφαση της Ιεράς Συνόδου της Εκκλησίας της Ελλάδος.[4]
   
    Πηγή: https://el.wikipedia.org/wiki/%CE%86%CE%B3%CE%B9%CE%BF%CF%82_%CE%A0%CE%B1%CE%90%CF%83%CE%B9%CE%BF%CF%82`,
    2.40
  )
];

export default PRODUCTS;
